Revit 2027 API
WallSweepInfo.MaterialId Property
 The element id of the material used to create the sweep or reveal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MaterialId { get; set; }
Public Property MaterialId As ElementId
	Get
	Set
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member MaterialId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This value is not used when creating standalone wall sweeps. The material id of the wall sweep's type is used instead.
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace